#########################################################################################
# Taps
#########################################################################################
tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "kevinswiber/postmanctl"
tap "koekeishiya/formulae"
tap "mrkai77/cask"
tap "noahgorstein/tap"
tap "warrensbox/tap"

#########################################################################################
# Brews
#########################################################################################
# Run your GitHub Actions locally
brew "act"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Per-project, per-directory shell environments
brew "autoenv"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# System monitoring dashboard for terminal
brew "gtop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Plugin manager for tmux
brew "tpm"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# View colored diff with side by side and auto pager support
brew "ydiff"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Age is a simple, modern and secure file encryption tool, format, and Go library.
brew "age"
# A better git diff pager, for side by side diff
brew "git-delta"

#########################################################################################
# Casks
#########################################################################################
# Command-line interface for 1Password
cask "1password-cli"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Nerd Font font with round corners
cask "font-maple"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-mono-nerd-font"
# Utility for comparing and merging files and directories
cask "kdiff3"
# GPU-based terminal emulator
cask "kitty"
# Neovim Client
cask "neovide"
# CLI for command-line API management on Postman
cask "postman-cli"
# Menu bar indicator showing the currently selected space
cask "spaceid"
# App to build and share containerised applications and microservices
cask "docker"
# macOS Space/desktop indicator for the menu bar
cask "spaceid"
# gui to manage brew installations
cask "cakebrew"
# Note takingapp
cask "obsidian"

vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "abbycin.vscode-onelight2"
vscode "airyshift.spaces-inside-braces"
vscode "akamud.vscode-theme-onedark"
vscode "almenon.arepl"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "andys8.jest-snippets"
vscode "arcanis.vscode-zipfs"
vscode "arturock.gitstash"
vscode "asvetliakov.typescript-language-features-multi-host"
vscode "atlassian.atlascode"
vscode "bmuskalla.vscode-tldr"
vscode "buenon.scratchpads"
vscode "cev.overnight"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dline.cobaltnext"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "drknoxy.eslint-disable-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "getpsalm.psalm-vscode-plugin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "idleberg.applescript"
vscode "janisdd.vscode-edit-csv"
vscode "leetcode.vscode-leetcode"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mikestead.dotenv"
vscode "milkmidi.vs-code-quick-require"
vscode "mintlify.document"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "njpwerner.autodocstring"
vscode "ollyhayes.colmak-vim"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryu1kn.partial-diff"
vscode "shakram02.bash-beautify"
vscode "shobhit01.cobalt2-italic"
vscode "shopify.ruby-lsp"
vscode "skyapps.fish-vscode"
vscode "sourcegraph.cody-ai"
vscode "steoates.autoimport"
vscode "stevejpurves.cucumber"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
