#########################################################################################
# Taps
#########################################################################################
tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "joshmedeski/sesh"
tap "kevinswiber/postmanctl"
tap "koekeishiya/formulae"
tap "mrkai77/cask"
tap "noahgorstein/tap"
tap "warrensbox/tap"
tap "hashicorp/tap"
# For sketchybar
tap "FelixKratz/formulae"

#########################################################################################
# Brews
#########################################################################################

#########################################################################################
# Install GNU tools
#########################################################################################
brew "coreutils"
brew "ed"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "make"
#########################################################################################
# End
#########################################################################################

# Run your GitHub Actions locally
brew "act"
# Per-project, per-directory shell environments
brew "autoenv"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# System monitoring dashboard for terminal
brew "gtop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Plugin manager for tmux
brew "tpm"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Fake keyboard/mouse input and window management for X
brew "xdotool"
# View colored diff with side by side and auto pager support
brew "ydiff"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# a TUI playground to experiment and play with jq
brew "noahgorstein/tap/jqp"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Age is a simple, modern and secure file encryption tool, format, and Go library.
brew "age"
# A better git diff pager, for side by side diff
brew "git-delta"
# Javascript package manager
brew "yarn"
# A command-line tool for displaying information about your systems
brew "neofetch"
# Run kubernetes locally
brew "minikube"
# Kubernetes CLI
brew "kubernetes-cli"
# Create machine images from configuration files
brew "hashicorp/tap/packer"
# Install newer version of bash
brew "bash"
# Installs isolate virtual environments for linking scripts. eg. pipx install aws-sso-util
brew "pipx"
# Tool to rerun a command every x seconds, e.g watch -n 1 osx-cpu-temp
brew "watch"
# Query HTML like jq but for HTML, uses CSS selectors
brew "htmlq"
# psql command line tool for PostgreSQL
brew "libpq"
brew "postgresql@15"
# Tool for networking 
brew "telnet"
# MonogoDB shell
brew "mongosh"
# Used for file type identification
brew "libmagic"
# xml query tool / formatter
brew "xq"
# MacOS menu bar
brew "sketchybar"
# Fast Rust NPM package manager
brew "pnpm"

#########################################################################################
# Casks
#########################################################################################
# Command-line interface for 1Password
cask "1password-cli"
# Opensource IDE for exploring and testing api's
cask "bruno"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-mono-nerd-font"
# GPU-based terminal emulator
cask "kitty"
# Neovim Client
cask "neovide"
# CLI for command-line API management on Postman
cask "postman-cli"
# macOS Space/desktop indicator for the menu bar
cask "spaceid"
# Note takingapp
cask "obsidian"
# Facebook messenger
cask "caprine"
# Calendar in the menu bar
cask "itsycal"
cask "bettertouchtool"
cask "karabiner-elements"
cask "spotify"
cask "obsidian"
cask "meetingbar"
cask "appcleaner"
cask "rectangle"
# Terminal emulator
cask "ghostty"
cask "google-cloud-sdk"
cask "raycast"
cask "font-maple-mono-nf"
cask "slack"
# Docker replacement
cask "orbstack"
cask "session-manager-plugin"
